# 결측치 처리
#1. 행 또는 열 삭제
#2. 임의의 값
    # 평균    : mean
    # 중위    : median      
    # 0       : fillna
    # 앞값    : ffill
    # 뒷값    : bfill
    # 특정값  : ....
#3. 보간(임의의 값) interploate - nan값을 linear(선형회귀방식)으로 찾아낸다.
#4. 모델 - 훈련 > predict(결측지) 
#결측치 값을 predict해서 나온 값을 결측지 자리에 넣어서 다시 훈련. 
#5. 부스팅계열 - 통상 결측치, 이상치에 대해 자유롭다다.

import pandas as pd 
import numpy as np
from datetime import datetime

dates = ['8/10/2022','8/11/2022','8/12/2022','8/13/2022','8/14/2022']
dates = pd.to_datetime(dates)
print(dates)
print("----------------------------------")

ts = pd.Series([2,np.nan,np.nan,8,10],index=dates)

print(ts)
print("----------------------------------")
ts = ts.interpolate()

print(ts)
print("----------------------------------")

# ----------------------------------
# 2022-08-10     2.0
# 2022-08-11     NaN                        nan값을 선형회귀방식으로 채운다. 
# 2022-08-12     NaN
# 2022-08-13     8.0
# 2022-08-14    10.0
# dtype: float64
# ----------------------------------
# 2022-08-10     2.0
# 2022-08-11     4.0
# 2022-08-12     6.0
# 2022-08-13     8.0
# 2022-08-14    10.0
# dtype: float64
# ----------------------------------